app/views/orders/index.html.erb

INSERT INTO "orders" ("name", "s_name", "patronymic", "phone", "email", "weight", "length", "width", "height", "dep_address", "arr_address", "distance", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
      <td><%= order.price %></td>
      <td><%= order.created_at %></td>