app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "s_name", "patronymic", "phone", "email", "weight", "length", "width", "height", "dep_address", "arr_address", "distance", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "orders" ("name", "s_name", "patronymic", "phone", "email", "weight", "length", "width", "height", "dep_address", "arr_address", "distance", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    selected_api = Api.find_by(is_on: true)[:name]
    additional_params = OrderCreator.create_order(order_params.merge(selected_api: selected_api))
    @order = current_user.orders.create(order_params.merge(additional_params))
    if @order.save